Repository: oxygenxml/blog
Catalog: translations/xliff/2nd translation/translated/oxygen_xml_blog_ro.ditamap.tmx
Source language: en
Languages: ro

source: Find topics about Git Push in the project and give me an overview of the most suitable ones.
ro: Găsește topicuri despre Git Push în proiect și oferă-mi o prezentare generală a celor mai potrivite.

source: This tool relies on the indexing capabilities of Oxygen XML Editor . If you are working with DITA maps opened from remote storage systems like a CMS, in the Preferences->Open/Find Resource page, you should check the Enable indexing for remote resources checkbox.
ro: Acest instrument se bazează pe capabilitățile de indexare ale Oxygen XML Editor . Dacă lucrați cu DITA map-uri deschise din sisteme de stocare la distanță, precum un CMS, în pagina Preferences->Open/Find Resource ar trebui să bifați opțiunea Enable indexing for remote resources .

source: Grep and perform exact string matches in the project, even by matching inside specific XML elements. For example:
ro: Grep și potrivire exactă de șiruri în proiect, inclusiv în interiorul unor elemente XML specifice. De exemplu:

source: Find places where the Save action is mentioned in DITA <uicontrol> elements.
ro: Găsește locurile unde acțiunea Save este menționată în elemente DITA <uicontrol>.

source: This tool is available only when working with local disk resources. In such a case, you should create a project in the Oxygen XML Editor Project view for your specific project folders.
ro: Acest instrument este disponibil doar când lucrați cu resurse de pe discul local. În acest caz, ar trebui să creați un proiect în vizualizarea Oxygen XML Editor Project pentru folderele proiectului dumneavoastră.

source: Explore the project folder structure. For example:
ro: Explorați structura folderelor proiectului. De exemplu:

source: Where should I save DITA maps in this project?
ro: Unde ar trebui să salvez DITA map-urile în acest proiect?

source: This tool is available only when working with local disk resources.
ro: Acest instrument este disponibil doar când lucrați cu resurse de pe discul local.

source: Tools to read content from the current or a different file. Example:
ro: Instrumente pentru a citi conținut din fișierul curent sau dintr-un alt fișier. Exemplu:

source: Give me suggestions about how to shorten the current document contents.
ro: Oferă-mi sugestii despre cum pot scurta conținutul documentului curent.

source: Tools to make large or small changes to the current or to other documents. Examples:
ro: Instrumente pentru a efectua modificări mari sau mici în documentul curent sau în alte documente. Exemple:

source: Shorten the title of the current document
ro: Scurtează titlul documentului curent

source: Find and fix logical inconsistencies in the current document
ro: Găsește și corectează inconsecvențele logice din documentul curent

source: Tools to provide validation and terminology problems reported for certain documents. If you have many style guide rules, it is advisable to implement them as Schematron rules or rules for the Oxygen XML Editor Terminology Checker add-on. Once you implement the checks, you can simply ask the AI:
ro: Instrumente pentru a furniza probleme de validare și terminologie raportate pentru anumite documente. Dacă aveți multe reguli de ghid de stil, este recomandat să le implementați ca reguli Schematron sau reguli pentru suplimentul Oxygen XML Editor Terminology Checker . Odată ce ați implementat verificările, puteți pur și simplu să cereți AI-ului:

source: Fix validation and terminology problems in the generated content before saving it to disk.
ro: Corectează problemele de validare și terminologie din conținutul generat înainte de a-l salva pe disc.

source: Tools to make XML-aware changes in documents:
ro: Instrumente pentru a efectua modificări XML-aware în documente:

source: Apply existing XML refactoring operations on documents. Example:
ro: Aplică operațiuni existente de refactorizare XML pe documente. Exemplu:

source: Invoke XML refactor operation to add unique IDs on all pargraphs
ro: Invocă operațiunea de refactorizare XML pentru a adăuga ID-uri unice la toate paragrafele

source: Apply XML refactoring using XSLT scripts created by the AI. Example:
ro: Aplică refactorizare XML folosind scripturi XSLT create de AI. Exemplu:

source: Invoke XML refactor with custom XSLT to replace all <b> elements with <uicontrol>
ro: Invocă refactorizarea XML cu XSLT personalizat pentru a înlocui toate elementele <b> cu <uicontrol>

source: Example: Use Custom XSLT to Refactor
ro: Exemplu: Folosește XSLT personalizat pentru refactorizare

source: Tools to call existing AI actions on documents. Examples:
ro: Instrumente pentru a apela acțiuni AI existente pe documente. Exemple:

source: Invoke the Proofread AI action on the current document content, then save the proposed changes to the document
ro: Invocă acțiunea AI Proofread pe conținutul documentului curent, apoi salvează modificările propuse în document

source: Invoke the improve readability AI action on the current document content, then save the proposed changes to the document
ro: Invocă acțiunea AI improve readability pe conținutul documentului curent, apoi salvează modificările propuse în document

source: Add Extra Tools with Model Context Protocol
ro: Adăugați instrumente suplimentare cu Model Context Protocol

source: The Model Context Protocol Preferences page in AI Positron allows you to connect to various MCP servers and allow the LLM to call tools implemented on remote or local servers.
ro: Pagina de preferințe Model Context Protocol din AI Positron vă permite să vă conectați la diverse servere MCP și să permiteți LLM-ului să apeleze instrumente implementate pe servere locale sau la distanță.

source: Sample configurations can be found in the Oxygen XML Editor user's manual .
ro: Configurații de exemplu pot fi găsite în manualul utilizatorului Oxygen XML Editor .

source: Model Context Protocol gives AI Positron the ability to provide for the LLM close integrations with the issue tracking system or the version control system, for example, to allow the LLM to extract the summary and comments made on a GitHub issue and create a draft documentation topic from it. Example prompt:
ro: Model Context Protocol oferă suplimentului AI Positron posibilitatea de a furniza LLM-ului integrări strânse cu sistemul de urmărire a problemelor sau cu sistemul de control al versiunilor, de exemplu, pentru a permite LLM-ului să extragă sumarul și comentariile de pe un issue GitHub și să creeze un topic de documentație draft pe baza acestora. Exemplu de prompt:

source: Obtain description and comments from the DITA OT GitHub issue number 2021 and create a draft documentation topic using them
ro: Obține descrierea și comentariile de la issue-ul DITA OT GitHub cu numărul 2021 și creează un topic de documentație draft folosindu-le

source: Example: Using MCP to access Atlassian JIRA
ro: Exemplu: Utilizarea MCP pentru accesarea Atlassian JIRA

source: Example: Using MCP to access GitHub issues
ro: Exemplu: Utilizarea MCP pentru accesarea problemelor GitHub

source: The entire set of tools provided by AI Positron can also be provided to external AI Assistants by starting the entire Oxygen XML Editor application as a local MCP server.
ro: Întregul set de instrumente oferit de AI Positron poate fi pus la dispoziție și pentru AI Assistants externi, pornind întreaga aplicație Oxygen XML Editor ca server MCP local.

source: Oxygen XML Editor as local MCP server
ro: Oxygen XML Editor ca server MCP local

source: Obtaining quality output and advice from the LLM, and making accurate changes using it, is all about the application giving the LLM enough context and allowing it to find extra context if the need arises.
ro: Obținerea de rezultate de calitate și sfaturi utile de la LLM, precum și realizarea de modificări precise cu ajutorul acestuia, depind de cât de mult context îi oferă aplicația și de posibilitatea de a găsi context suplimentar atunci când este nevoie.

source: Starting with the use of quality LLMs, combined with a well-created and distilled project context prompt, then continuing with tools that give the LLM access to explore the project and make consistent changes, your short prompts and commands end up being properly interpreted and acted upon.
ro: Începând cu utilizarea unor LLM-uri de calitate, combinate cu un prompt de context de proiect bine creat și distilat, continuând cu instrumente care oferă LLM-ului acces la explorarea proiectului și realizarea de modificări consistente, ajungeți ca prompturile și comenzile scurte să fie interpretate și executate corect.

source: What is New in Oxygen AI Positron Assistant 5.0
ro: Ce este nou în Oxygen AI Positron Assistant 5.0

source: The new Oxygen AI Positron Assistant 5.0 brings meaningful improvements to help content creators use AI more effectively in structured authoring.
ro: Noul Oxygen AI Positron Assistant 5.0 aduce îmbunătățiri semnificative pentru a ajuta creatorii de conținut să utilizeze AI mai eficient în authoring structurat.

source: One of the most useful updates is the ability to generate or update files like XSLT , XSD , Schematron , JSON Schema , and DTD just by providing a brief description. You can then review changes using the built-in visual file comparison tool.
ro: Una dintre cele mai utile actualizări este posibilitatea de a genera sau actualiza fișiere precum XSLT , XSD , Schematron , JSON Schema și DTD doar oferind o scurtă descriere. Ulterior, puteți revizui modificările folosind instrumentul integrat de comparare vizuală a fișierelor .

source: For DITA users , the assistant now supports advanced content transformation , making it easy to convert between document types or restructure topics using AI suggestions.
ro: Pentru utilizatorii DITA , asistentul oferă acum funcții avansate de transformare a conținutului , facilitând conversia între tipuri de documente sau restructurarea topicurilor folosind sugestii AI.

source: Other key updates include:
ro: Alte actualizări importante includ:

source: Eclipse plugin support
ro: Suport pentru plugin Eclipse

source: The option to exclude specific files from AI processing
ro: Opțiunea de a exclude anumite fișiere din procesarea AI

source: Callback functions for validation or tool integration
ro: Funcții callback pentru validare sau integrare cu alte instrumente

source: Support for attaching Word, PowerPoint, and PDF files as input
ro: Suport pentru atașarea fișierelor Word, PowerPoint și PDF ca input

source: Access to new reasoning models like o3 , o1 , o4-mini , and more
ro: Acces la noi modele de reasoning precum o3 , o1 , o4-mini și altele

source: Integration with xAI Grok and other custom AI services through specialized connectors
ro: Integrare cu xAI Grok și alte servicii AI personalizate prin conectori specializați

source: Additional refinements improve comment resolution, validation fixes, and allow referencing external resources or prompts.
ro: Alte îmbunătățiri vizează rezolvarea comentariilor, corectarea validărilor și permit referințe către resurse sau prompturi externe.

source: You can see the new features in action in this overview video:
ro: Puteți vedea noile funcționalități în acțiune în acest videoclip de prezentare:
